Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
// Parser found a new message start
void CanFD2040::report_note_message_start() noexcept
{
    pio_irq_set_maytx();
}

// Setup for ack injection (if receiving) or ack confirmation (if transmit)
void CanFD2040::report_note_crc_start() noexcept
{
	// Get 19 bits of expected data (lower 15 bits of CRC plus 4 stuff bits)
	uint32_t expectedData = (parse_crc & 0x01)						// bit 0 of CRC
						  | (~parse_crc & 0x02)						// fixed stuff bit = inverse of bit 1
						  | ((parse_crc & 0x1e) << 1)				// bits 1-4 of CRC
						  | ((~parse_crc & 0x20) << 1)				// fixed stuff bit = inverse of bit 5
						  | ((parse_crc & 0x1e0) << 2)				// bits 5-8 of CRC
						  | ((~parse_crc & 0x0200) << 2)			// fixed stuff bit = inverse of bit 9
						  | ((parse_crc & 0x1e00) << 3)				// bits 9-12 of CRC
						  | ((~parse_crc & 0x2000) << 3)			// fixed stuff bit = inverse of bit 13
						  | ((parse_crc & 0x6000) << 4);			// bits 13-14 of CRC
    const uint32_t cs = unstuf.GetStuffCount();
    const uint32_t crcstart_bitpos = raw_bit_count - cs - 1;
    const uint32_t crcend_bitpos = crcstart_bitpos + 19;

    if (tx_check_local_message())
    {
        // This is a self transmit - setup tx eof "matched" signal
        report_state = (ReportState)(ReportState::RS_IN_MSG | ReportState::RS_IS_TX);
        expectedData = (expectedData << 10) | 0x02ff;
        pio_match_check(pio_match_calc_key(expectedData, crcend_bitpos + 10));
    }
    else if (rxFifoNumber < NumCanRxFifos)
    {
		// Inject ack
		report_state = ReportState::RS_IN_MSG;
		expectedData = (expectedData << 1) | 0x01;
		const uint32_t match_key = pio_match_calc_key(expectedData, crcend_bitpos + 1);
	    if (   tx_state == TS_QUEUED
	    	&& !pio_tx_did_conflict()
	        && pio_rx_fifo_level() > 1
		   )
	    {
	        // Rx state is behind - acking wont succeed and may halt active tx
	    }
	    else
	    {
			tx_state = TS_ACKING_RX;
			pio_tx_inject_ack(match_key);
			pio_irq_set_maytx_ackdone();

			// Setup for future rx eof "matched" signal
			expectedData = (expectedData << 8) | 0x7f;
			report_eof_key = pio_match_calc_key(expectedData, crcend_bitpos + 9);
		}
    }
}

// Parser found successful ack
void CanFD2040::report_note_ack_success() noexcept
{
    if (!(report_state & ReportState::RS_IN_MSG))
        // Got rx "ackdone" and "matched" signals already
        return;
    report_state = (ReportState)(report_state | ReportState::RS_AWAIT_EOF);
    if (report_state & ReportState::RS_IS_TX)
        // Enable "matched" irq for fast back-to-back transmit scheduling
        pio_irq_set_maytx_matched();
}

// Parser found successful EOF
void CanFD2040::report_note_eof_success() noexcept
{
    report_handle_eof();
}

// Parser found unexpected data on input
void CanFD2040::report_note_parse_error() noexcept
{
    if (report_state != ReportState::RS_IDLE) {
        report_state = ReportState::RS_IDLE;
        pio_match_clear();
    }
    pio_sync_slow_start_signal();
    pio_irq_set_maytx();
}

// Received PIO rx "ackdone" irq
void CanFD2040::report_line_ackdone() noexcept
{
    if (!(report_state & ReportState::RS_IN_MSG)) {
        // Parser already processed ack and eof bits
        pio_irq_set_maytx();
        return;
    }
    // Setup "matched" irq for fast rx callbacks
    report_state = (ReportState)(ReportState::RS_IN_MSG | ReportState::RS_AWAIT_EOF);
    pio_match_check(report_eof_key);
    pio_irq_set_maytx_matched();
    // Schedule next transmit (so it is ready for next frame line arbitration)
    tx_schedule_transmit();
}

// Received PIO "matched" irq
void CanFD2040::report_line_matched() noexcept
{
    // Implement fast rx callback and/or fast back-to-back tx scheduling
    report_handle_eof();
    pio_irq_set_none();
    tx_schedule_transmit();
}

// Received 10+ passive bits on the line (between 10 and 17 bits)
void CanFD2040::report_line_maytx() noexcept
{
    // Line is idle - may be unexpected EOF, missed ack injection,
    // missed "matched" signal, or can2040_transmit() kick.
    report_handle_eof();
    pio_irq_set_none();
    tx_schedule_transmit();
}

// Transition to the next parsing state
void CanFD2040::data_state_go_next(ParseState state, uint32_t bits) noexcept
{
    parse_state = state;
    unstuf.SetCount(bits);
}

// Transition to the MS_DISCARD state - drop all bits until 6 passive bits
void CanFD2040::data_state_go_discard() noexcept
{
    report_note_parse_error();
    unstuf.UseNormalStuffBits();

    if (pio_rx_check_stall())
    {
        // CPU couldn't keep up for some read data - must reset pio state
        raw_bit_count = 0;
        unstuf.ClearStuffCount();
        pio_sm_setup();
        report_callback_error(0);
    }

    data_state_go_next(MS_DISCARD, 32);
}

// Received six dominant bits on the line
void CanFD2040::data_state_line_error() noexcept
{
    data_state_go_discard();
}

// Received six passive bits on the line
void CanFD2040::data_state_line_passive() noexcept
{
    if (parse_state != MS_DISCARD)
    {
        // Bitstuff error
        data_state_go_discard();
    }
    else
    {
    	unstuf.UseNormalStuffBits();
		const uint32_t stuffed_bits = unstuf.GetStuffedBits() >> unstuf.GetStuffCount();
		if (stuffed_bits == 0xffffffff)
		{
			// Counter overflow in "sync" state machine - reset it
			pio_sync_setup();
			unstuf.ClearStuffedBits();
			data_state_go_discard();
		}
		else if (((stuffed_bits + 1) & 0x1ff) == 0)		// look for sof after 9 passive bits (most "PIO sync" will produce)
		{
			data_state_go_next(MS_START, 1);
		}
		else
		{
			data_state_go_discard();
		}
    }
}

// Transition to MS_DATA0 state (if applicable) - await data bits
void CanFD2040::data_state_go_data() noexcept
{
	if (parse_dlc == 0)
    {
        data_state_go_stuff_count();						// no data in packet
    }
	else
	{
		parse_bytesReceived = 0;
		parse_bytesLeft = (parse_dlc <= 8) ? parse_dlc
							: (parse_dlc <= 12) ? (parse_dlc - 6) << 2
								: (parse_dlc - 11) << 4;
		data_state_go_next(MS_DATA, 8 * min<uint32_t>(parse_bytesLeft, 4));
	}
}

