Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
// Transition to MS_STUFFCOUNT state
void CanFD2040::data_state_go_stuff_count() noexcept
{
	unstuf.UseFixedStuffBits();								// tell the unstuffer that the next bit and then every 4 bits are forced stuff bits
	data_state_go_next(MS_STUFFCOUNT, (parse_dlc > 10) ? 10 : 6);	// receive the 4 stuff count bits + the first 2 or 6 CRC bits (and 2 fixed stuff bits)
}

// Handle reception of first bit of header (after start-of-frame (SOF))
void CanFD2040::data_state_update_start(uint32_t data) noexcept
{
	rxTimeStamp = timer_hw->timerawl;						// save time stamp for later
	data &= 0x01;
    parse_id = data;										// store the first data bit (MSbit of ID)
    report_note_message_start();
    unstuf.UseNormalStuffBits();							// reset the bit stuffing counter
    unstuf.SetCrc17(Crc17(crc17initialValue, data, 2));		// add the SOF and the first header bit to the CRC
    unstuf.SetCrc21(Crc21(crc21initialValue, data, 2));		// add the SOF and the first header bit to the CRC
    data_state_go_next(MS_HEADER, 20);
}

// If there is space in receive fifo 'whichFifo', set rxMessage and FifoNumber accordingly, else leave them alone and flag the overflow
void CanFD2040::SetupToReceive(unsigned int whichFifo, bool extendedId) noexcept
{
	if (whichFifo < NumCanRxFifos)
	{
		VirtualCanRegisters::RxFifo& fifo = regs->rxFifos[whichFifo];
		const uint32_t putIndex = fifo.putIndex;
		uint32_t nextPutIndex = putIndex + 1;
		if (nextPutIndex == fifo.size)
		{
			nextPutIndex = 0;
		}
		if (nextPutIndex != fifo.getIndex)
		{
			CanRxBuffer& rxBuffer = const_cast<CanRxBuffer&>(fifo.buffers[putIndex]);
			rxBuffer.R0.bit.XTD = extendedId;
			rxBuffer.R1.bit.RXTS = rxTimeStamp;
			rxMessage = rxBuffer.data;
			rxFifoNumber = whichFifo;
		}
		else
		{
			++regs->errors.rxFifoOverlow[whichFifo];
		}
	}
}

// Handle reception of next 20 header bits which for CAN-FD frame with short ID takes us up to and including the DLC bits
void CanFD2040::data_state_update_header(uint32_t data) noexcept
{
    data |= parse_id << 20;									// or in the most significant ID bit
    if ((data & 0x0300) == 0x0300)							// if SRR and ID are both set
    {
        // Extended ID
        parse_id = ((data & 0x1ffc00) << 8) | ((data & 0x00ff) << 10);	// this is now the top 19 bits of the ID field
        data_state_go_next(MS_EXT_HEADER, 19);
    }
    else if ((data & 0x3e0) == 0x80)						// if r1 and IDE are both clear, FDF is set, r0 and and BRS are clear
    {
		// Short ID
		parse_id = (data >> 10) & 0x7ff;					// save the complete ID
		parse_dlc = data & 0x0F;

		// See if we are interested in this message
		rxFifoNumber = NumCanRxFifos;						// set an invalid fifo number
		rxMessage = rxDummyMessage;
		for (unsigned int filterNumber = 0; filterNumber < regs->numShortFilterElements; ++filterNumber)
		{
			const CanStandardMessageFilterElement& f = const_cast<const CanStandardMessageFilterElement&>(regs->shortFiltersAddr[filterNumber]);
			if (f.Matches(parse_id))
			{
				SetupToReceive(f.whichBuffer, false);
				break;
			}
		}

		data_state_go_data();
    }
	else
	{
		++regs->errors.wrongMessageType;
		data_state_go_discard();							// not a message format we can parse
	}
}

// Handle reception of additional 19 bits of "extended header" which takes us to the end of the DLC field
void CanFD2040::data_state_update_ext_header(uint32_t data) noexcept
{
	if ((data & 0x1e0) == 0x80)								// if FDF bit is set, and r1, BRS and r0 are not set
	{
		parse_id |= (data >> 9) & 0x03ffff;					// or-in the bottom 18 bits of the ID
		parse_dlc = data & 0x0F;

		// See if we are interested in this message
		rxFifoNumber = NumCanRxFifos;						// set an invalid fifo number
		rxMessage = rxDummyMessage;
		for (unsigned int filterNumber = 0; filterNumber < regs->numExtendedFilterElements; ++filterNumber)
		{
			const CanExtendedMessageFilterElement& f = const_cast<const CanExtendedMessageFilterElement&>(regs->extendedFiltersAddr[filterNumber]);
			if (f.Matches(parse_id))
			{
				SetupToReceive(f.whichBuffer, true);
				break;
			}
		}

		data_state_go_data();
	}
	else
	{
		++regs->errors.wrongMessageType;
		data_state_go_discard();
	}
}

// Handle reception of data content
void CanFD2040::data_state_update_data(uint32_t data) noexcept
{
	if (parse_bytesLeft < 4)
	{
	    rxMessage[parse_bytesReceived/4] = __builtin_bswap32(data << (32 - (8 * parse_bytesLeft)));
	    data_state_go_stuff_count();
	}
	else
	{
		rxMessage[parse_bytesReceived/4] = __builtin_bswap32(data);
		parse_bytesReceived += 4;
		parse_bytesLeft -= 4;
		if (parse_bytesLeft != 0)
		{
			data_state_go_next(MS_DATA, 8 * min<uint32_t>(parse_bytesLeft, 4));
		}
		else
		{
			data_state_go_stuff_count();
		}
	}
}

// Handle reception of 4 bits of message stuff count and 2 or 6 bytes of CRC
void CanFD2040::data_state_update_stuffCount(uint32_t data) noexcept
{
	uint32_t stuffCount;
	uint32_t crcBits;
	if (parse_dlc > 10)
	{
		stuffCount = data >> 6;													// get stuff count and parity bit
		parse_crc = Crc21(unstuf.GetCrc21(), stuffCount, 4) >> (32 - 21);		// set up the expected CRC
		crcBits = data & 0x3f;													// get top 6 bits of CRC
	}
	else
	{
		stuffCount = data >> 2;													// get stuff count and parity bit
		parse_crc = Crc17(unstuf.GetCrc17(), stuffCount, 4) >> (32 - 17);		// set up the expected CRC
		crcBits = data & 0x03;													// get top 2 bits of CRC
	}

	// Check stuff count parity (should be even) and stuff count
	//TODO remove this separate parity check when we have sorted out the count of stuff bits
	if (unlikely((stuffCount & 0x0f) != GrayTable[unstuf.GetTotalStuffBits() & 0x07]))
	{
		// Check whether the parity is wrong so we can report a parity error separately
		uint32_t parity = stuffCount ^ (stuffCount >> 2);
		parity ^= (parity >> 1);
		if (parity & 1u)
		{
			++regs->errors.stuffCountParity;
		}
		else
		{
			++regs->errors.wrongStuffCount;
		}
		data_state_go_discard();
	}
	else
#if 1	// check CRC but for now don't quit if it doesn't match
	if ((parse_crc >> 15) != crcBits)
	{
		++regs->errors.wrongCrc;
	}
	if (true)
#else
	if ((parse_crc >> 15) == crcBits)
#endif
	{
		// Transition to MS_CRC state - await another 15 bits of crc + delimiter
		report_note_crc_start();
		data_state_go_next(MS_CRC, 16);		// read 15 more CRC bits (plus fixed stuffing bits) plus delimiter
	}
	else
	{
		++regs->errors.wrongCrc;
		data_state_go_discard();
	}
}

// Handle reception of 16 bits of message CRC (15 crc bits + crc delimiter)
void CanFD2040::data_state_update_crc(uint32_t data) noexcept
{
	if ((data & 1u) != 1u)					// just check the delimiter
	{
		++regs->errors.missingCrcDelimiter;
		data_state_go_discard();
	}
#if 0
	else if ((((parse_crc & 0x7fff) << 1) | 1u) != (data & 0xffff))
    {
    	++regs->errors.wrongCrc;
        data_state_go_discard();
    }
#endif
    else
    {
#if 1
    	if ((((parse_crc & 0x7fff) << 1) | 1u) != (data & 0xffff))
		{
			++regs->errors.wrongCrc;		// for now, record the error but don't quit
		}
#endif
		unstuf.ClearState();
		data_state_go_next(MS_ACK, 2);
    }
}

// Handle reception of 2 bits of ack phase (ack, ack delimiter)
void CanFD2040::data_state_update_ack(uint32_t data) noexcept
{
	if ((data & 0x01) != 0x01)		//TEMP don't check ACK, just check the delimiter
 //   if (data != 0x01)
    {
		++regs->errors.missingAckDelimiter;
        data_state_go_discard();
    }
	else
	{
		report_note_ack_success();
		data_state_go_next(MS_EOF0, 4);
	}
}

// Handle reception of first four end-of-frame (EOF) bits
void CanFD2040::data_state_update_eof0(uint32_t data) noexcept
{
    if (data != 0x0f || pio_rx_check_stall())
    {
    	++regs->errors.missingEofBit;
        data_state_go_discard();
    }
    else
    {
    	data_state_go_next(MS_EOF1, 4);
    }
}

// Handle reception of end-of-frame (EOF) bits 5-7 and first IFS bit
void CanFD2040::data_state_update_eof1(uint32_t data) noexcept
{
	unstuf.UseNormalStuffBits();
    if (data >= 0x0e || (data >= 0x0c && report_is_acking_rx()))
    {
        // Message is considered fully transmitted
        report_note_eof_success();
    }

    if (data == 0x0f)
    {
        data_state_go_next(MS_START, 1);
    }
    else
    {
    	++regs->errors.missingEofBit;
        data_state_go_discard();
    }
}

// Handle data received while in MS_DISCARD state
void CanFD2040::data_state_update_discard(uint32_t data) noexcept
{
    data_state_go_discard();
}

// Update parsing state after reading the bits of the current field
void CanFD2040::data_state_update(uint32_t data) noexcept
{
	switch (parse_state)
	{
	case MS_START:		data_state_update_start(data); break;
	case MS_HEADER:		data_state_update_header(data); break;
	case MS_EXT_HEADER:	data_state_update_ext_header(data); break;
	case MS_DATA:		data_state_update_data(data); break;
	case MS_STUFFCOUNT:	data_state_update_stuffCount(data); break;
	case MS_CRC:		data_state_update_crc(data); break;
	case MS_ACK:		data_state_update_ack(data); break;
	case MS_EOF0:		data_state_update_eof0(data); break;
	case MS_EOF1:		data_state_update_eof1(data); break;
	case MS_DISCARD:	data_state_update_discard(data); break;
	}
}

/****************************************************************
 * Input processing
 ****************************************************************/

// Process an incoming byte of data from PIO "rx" state machine
void CanFD2040::process_rx(uint32_t rx_byte) noexcept
{
	unstuf.AddBits(rx_byte, 8);
    raw_bit_count += 8;

    // undo bit stuffing
    for (;;)
    {
        int ret = unstuf.PullBits();
        if (likely(ret > 0))
        {
            // Need more data
            break;
        } else if (likely(!ret))
        {
            // Pulled the next field - process it
            data_state_update(unstuf.GetUnstuffedBits());
        } else
        {
            if (ret == -1)
            {
                // 6 consecutive high bits
                data_state_line_passive();
            }
            else
            {
                // 6 consecutive low bits, or incorrect fixed stuff bit
            	++regs->errors.badStuffing;
                data_state_line_error();
            }
        }
    }
}

